#абвгде....я
#123456
#бвгдеє...а
#234567
#баба = вбвб
#функція для шифрування(отримує букву)

index = -3
def tochp (a):
  #повертає зашифровану букву
  #узнати число по абеткі 113 - ord('a') =16
  a_i = ord(a)-ord('a')
  #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
  new_index = (a_i +index)%26
  # отримуєм саму букву = нчза+ ord('a')
  new_char = new_index + ord("a")
  return chr(new_char)
#функція для розшифрування
def frchp (a):
  #повертає розшифровану букву
    #узнати число по абеткі 113 - ord('a') =16
  a_i = ord(a)-ord('a')
  #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
  new_index = (a_i - index)%26
  # отримуєм саму букву = нчза+ ord('a')
  new_char = new_index + ord("a")
  return chr(new_char)
#Користувач вводить текст
text = input('Enter the text\n')
#пустий список для зашифрованого тексту
f = []
#пустий список для розшифрованого тексту
ff = []
#проходим по кожній букві
for i in text:
  #шифруємо і записуємо результат в список
  if i == ' ':
    f.append(' ')
  else:
    f.append(tochp(i))
#проходимо по кожній букві
for i in f:
  #розшифровуваємо і записуємо
  if i == ' ':
    ff.append(' ')
  else:
   ff.append(frchp(i))

print(f)
print(ff)
