abetka = ['а', 'б', 'в', 'г', 'ґ', 'д', 'е', 'є', 'ж', 'з', 'и', 'і', 'ї', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ь', 'ю', 'я']
abetka_L = ['А', 'Б', 'В', 'Г', 'Ґ', 'Д', 'Е', 'Є', 'Ж', 'З', 'И', 'І', 'Ї', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ь', 'Ю', 'Я']
index = 2

#Як прописати функцію ????

def ord_ua(a):
  if a.isupper():
    return abetka_L.index(a)
    
  else:
    return abetka.index(a)

def chr_ua(a):
  return abetka[a]
def chr_L_ua(a):
  return abetka_L[a]


def tochp_ua (a):
  if a.isupper():  
    #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
    new_index = (ord_ua(a) +index)%33
    # отримуєм саму букву = нчза+ ord('a')
    return chr_L_ua(new_index)
  elif a.islower():
    
    #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
    new_index = (ord_ua(a) +index)%33
    # отримуєм саму букву = нчза+ ord('a')
 
    return chr_ua(new_index)

def frchp_ua (a):
  if a.isupper():  
    #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
    new_index = (ord_ua(a) - index)%33
    # отримуєм саму букву = нчза+ ord('a')
    return chr_L_ua(new_index)
  elif a.islower():
    
    #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
    new_index = (ord_ua(a) - index)%33
    # отримуєм саму букву = нчза+ ord('a')
 
    return chr_ua(new_index)
text = input('Enter the text\n')

f = ''
ff = ''
for i in text:
  #шифруємо і записуємо результат в список
  if i == ' ':
    f = f +' '
  else:
    f = f+tochp_ua(i)
    
for i in f:
  #шифруємо і записуємо результат в список
  if i == ' ':
    ff = ff +' '
  else:
    ff = ff+frchp_ua(i)

   
print(f)
print(ff)

















def tochp (a):
  if a.isupper():  
    #узнати число по абеткі 113 - ord('a') =16
    a_i = ord(a)-ord('А')
    #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
    new_index = (a_i +index)%33
    # отримуєм саму букву = нчза+ ord('a')
    new_char = new_index + ord("А")
    return chr(new_char)
  else:
    #узнати число по абеткі 113 - ord('a') =16
    a_i = ord(a)-ord('а')
    #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
    new_index = (a_i +index)%33
    # отримуєм саму букву = нчза+ ord('a')
    new_char = new_index + ord("а")
    return chr(new_char)

#функція для розшифрування
def frchp (a):
  if a.isupper():
    #повертає розшифровану букву
      #узнати число по абеткі 113 - ord('a') =16
    a_i = ord(a)-ord('А')
    #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
    new_index = (a_i - index)%33
    # отримуєм саму букву = нчза+ ord('a')
    new_char = new_index + ord("А")
    return chr(new_char)
  else:
    #повертає розшифровану букву
    #узнати число по абеткі 113 - ord('a') =16
    a_i = ord(a)-ord('а')
  #число по абеткі + індекс шифрування "ділим" 26 = нове число за абеткою(зашифрована правильно буква)
    new_index = (a_i - index)%33
  # отримуєм саму букву = нчза+ ord('a')
    new_char = new_index + ord("а")
    return chr(new_char)
    
#Користувач вводить текст
#text = input('Enter the text\n')
#пустий список для зашифрованого тексту
f = ''
#пустий список для розшифрованого тексту
ff = ''
#проходим по кожній букві
#for i in text:
  #шифруємо і записуємо результат в список
#  if i == ' ':
#    f = f +' '
#  else:
#    f = f+tochp(i)
#проходимо по кожній букві
#for i in f:
  #розшифровуваємо і записуємо
#  if i == ' ':
#    ff = ff + (' ')
#  else:
#   ff = ff + (frchp(i))

#print(f)
#print(ff)
